universities = {
    "ИТМО": {"city": "Санкт-Петербург",
             "программы": [{"код программы": "09.03.02",

                            }, "01.03.02", "09.03.02"]}
}

olympiads_inf = {
    "Высшая проба": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Всесибирская открытая олимпиада школьников": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Вузовско-академическая олимпиада по информатике": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Международная олимпиада «Innopolis Open»": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Московская олимпиада школьников": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Олимпиада школьников по информатике и программированию": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Олимпиада школьников по программированию «ТехноКубок»": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Олимпиада школьников Санкт-Петербургского государственного университета": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Открытая олимпиада школьников": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Открытая олимпиада школьников по программированию": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Олимпиада школьников «Ломоносов»": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Открытая олимпиада школьников по программированию «Когнитивные технологии»": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Международная олимпиада школьников Уральского федерального университета «Изумруд»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Межрегиональные предметные олимпиады федерального государственного автономного образовательного учреждения высшего образования «Казанский (Приволжский) федеральный университет»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Олимпиада школьников «Гранит науки»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Олимпиада школьников «Шаг в будущее»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "информатика и вычислительная техника"
    },
    "Отраслевая олимпиада школьников «Газпром»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Отраслевая физико-математическая олимпиада школьников «Росатом»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "информатика"
    },
    "Университетская олимпиада школьников «Бельчонок»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "информатика"
    }
}

olympiads_math = {
    "Высшая проба": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Московская олимпиада школьников": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Олимпиада Курчатов": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Олимпиада школьников «Ломоносов»": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Олимпиада школьников «Покори Воробьевы горы!»": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Олимпиада школьников «Физтех»": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Олимпиада школьников Санкт-Петербургского государственного университета": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Санкт-Петербургская олимпиада школьников": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Турнир городов": {
        "уровень": 1,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "«Формула Единства»/«Третье тысячелетие»": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Всесибирская открытая олимпиада школьников": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Межрегиональная олимпиада школьников имени И.Я. Верченко": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Межрегиональная олимпиада школьников на базе ведомственных образовательных организаций": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Объединенная межвузовская математическая олимпиада школьников": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Олимпиада Юношеской математической школы": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Открытая олимпиада школьников": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Отраслевая физико-математическая олимпиада школьников «Росатом»": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Турнир имени М.В. Ломоносова": {
        "уровень": 2,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Всероссийская олимпиада школьников «Миссия выполнима. Твое призвание - финансист!»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Международная олимпиада «Innopolis Open»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Международная олимпиада школьников Уральского федерального университета «Изумруд»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Межрегиональная олимпиада школьников «САММАТ»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика и механика, компьютерные и информационные науки, информатика и вычислительная техника, информационная безопасность, техника и технологии строительства"
    },
    "Межрегиональная олимпиада школьников «Будущие исследователи - будущее науки»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Межрегиональные предметные олимпиады федерального государственного автономного образовательного учреждения высшего образования «Казанский (Приволжский) федеральный университет»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Олимпиада школьников «Надежда энергетики»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Олимпиада школьников «Шаг в будущее»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика"
    },
    "Университетская олимпиада школьников «Бельчонок»": {
        "уровень": 3,
        "формат проведения": "очный",
        "предмет": "математика"
    }
}
